https://github.com/okovtun/SBD_011
https://www.youtube.com/watch?v=-RHChK8SrmA&list=PLeqyOOqxeiIOl01ZQIk419F03KIHUISGd&index=1&t=1245s

TODO:
Перегрузить фунции Sort, Sum, Avg, minValueIn, maxValueIn для одномерного и двумерного массива типа int, char и double.
По возможности залить код на GitHub, и прислать ссылку на репозиторий, если не получится, то присылайте как обычно *.cpp-файл.

DONE:
Одномерный массив из десяти элементов заполнить случайными числами, после чего найти в нем повторяющиеся значения, вывести их на экран, а также вывести на экран количество повторений каждого найденного значения.

DONE:
1. Вывести на экран таблицу умножения;
2. Вывести на экран таблицу Пифагора;
3. Вывести на экран все фигуры из файла: https://github.com/okovtun/SBD_011/blob/master/ControlStructures/Task/Geometria1.txt

DONE:
1. Используя цикл for, написать программу, которая вычисляет факториал числа, введенного с клавиатуры;
2. Исползуя цикл for возвести указанное число, в указанную степень;
3. Вывести на экран таблицу ASCII-символов, разделенных пробелами, по 16 символов в строке.

DONE:
1. Написать условие do...while таким образом, чтобы выход из цикла осуществлялся клавишей Escape;
2. Написать программу 3Dshooter, которая выводит на экран действие пользователя, в зависимости от нажатой клавиши:
w - вперед
s - назад
a - влево
d - вправо
space - прыжок
enter - огонь
escape - выход.

DONE:
1. Написать программу калькулятор, которая вычисляет выражения вида: 
	Введите выражение: 2+3
	2+3 = 5;
2. С клавиатуры вводится число. Программа должна сказать, это число Палиндром, или нет. 12321

Что будет выведено на экран в каждом из этих случаев:

----------------------------- 1 --------------------------------
int i = 3;
i = ++i + ++i;
cout << i << endl;

----------------------------- 2 --------------------------------

int i = 3;
i = i++ + ++i;
cout << i << endl;

----------------------------- 3 --------------------------------

int i = 3;
i = i++ + 1 + ++i * 2;
cout << i << endl;

----------------------------- 4 --------------------------------

int i = 3;
i = i++ + 1 + ++i *= 2;
cout << i << endl;

----------------------------- 5 --------------------------------

int i = 3;
i += i++ + 1 + ++i *= 2;
cout << i << endl;


DONE:
В окно консоли вывести стишок "В лесу родилась Ёлочка".
Стишок должн быть выровнен по середине окна консоли, и его куплеты должны быть отделены пустой строкой друг от друга.