https://github.com/okovtun/SBD_011
https://www.youtube.com/watch?v=-RHChK8SrmA&list=PLeqyOOqxeiIOl01ZQIk419F03KIHUISGd&index=1&t=1245s

TODO:
1. Написать программу калькулятор, которая вычисляет выражения вида: 
	Введите выражение: 2+3
	2+3 = 5;
2. С клавиатуры вводится число. Программа должна сказать, это число Палиндром, или нет. 12321

Что будет выведено на экран в каждом из этих случаев:

----------------------------- 1 --------------------------------
int i = 3;
i = ++i + ++i;
cout << i << endl;

----------------------------- 2 --------------------------------

int i = 3;
i = i++ + ++i;
cout << i << endl;

----------------------------- 3 --------------------------------

int i = 3;
i = i++ + 1 + ++i * 2;
cout << i << endl;

----------------------------- 4 --------------------------------

int i = 3;
i = i++ + 1 + ++i *= 2;
cout << i << endl;

----------------------------- 5 --------------------------------

int i = 3;
i += i++ + 1 + ++i *= 2;
cout << i << endl;


DONE:
В окно консоли вывести стишок "В лесу родилась Ёлочка".
Стишок должн быть выровнен по середине окна консоли, и его куплеты должны быть отделены пустой строкой друг от друга.